# Задача 16: Требуется вычислить, сколько раз встречается некоторое
# число X в массиве A[1..N]. Пользователь в первой строке вводит
# натуральное число N – количество элементов в массиве. В последующих
# строках записаны N целых чисел Ai
# . Последняя строка содержит число X
# 5
# 1 2 3 4 5
# 3
# -> 1

# import random
# N = int(input("Введите количество элементов в списке : "))
#sp = list(range(1, N + 1))
# print(sp)
# X = int(input("Вветиде число X : "))

# if X in sp:
#     count = sp.count(X)
#     print(count)
# else:
#     print("Такого числа нет")


# Задача 18: Требуется найти в массиве A[1..N] самый близкий по
# величине элемент к заданному числу X. Пользователь в первой строке
# вводит натуральное число N – количество элементов в массиве. В
# последующих строках записаны N целых чисел Ai
# . Последняя строка
# содержит число X
# 5
# 1 2 3 4 5
# 6
# -> 5

# import random
# N = int(input("Введите количество элементов в списке : "))
# sp = list(range(1, N + 1))
# print(sp)
# X = int(input("Вветиде число X : "))


# # if num in sp:
# if X - 1 in sp:
#     sp = X - 1
#     print(sp)
# else:    
#     print("Ошибка")